{
    "your-name": "Jorge Luis Cuellar Mondeja",
    "title": "Computer Science Engineer",
    "role": ".NET Back-End Developer",
    "about-me": "As a seasoned Computer Science Engineer with over 15 years of expertise in the software development industry, I specialize in .NET development. Having successfully completed 20+ projects, my focus spans ERP systems and cutting-edge technologies, particularly in electronic payment transactions and value-added services at points of sale, all executed within the .NET framework. My versatile roles, ranging from Analyst Programmer to Solutions Architect, showcase my comprehensive experience in all facets of .NET software development. I've effectively led teams and contributed to academia as a thesis tutor, enriching emerging professionals within the .NET ecosystem. Proficient in both agile (Scrum, Kanban) and traditional methodologies, I've excelled in managing .NET projects. My international exposure has honed adaptability, allowing me to seamlessly navigate cross-border .NET projects. From initial client interactions to post-implementation support, I offer holistic insights, providing tailored .NET solutions aligned with organizational goals. Eager to contribute my .NET skills and experience to your team and drive success.",
    "work-experience": [
        {
            "company": "FREELANCER",
            "role": "Full Stack Developer",
            "roleDescription": ".NET Backend Developer specializing in application business logic.",
            "place": "Alicante",
            "start": "Mar 2023",
            "end": "Present",
            "responsabilities": [
                "Proficient in creating API and web services using ASP.NET Core",
                "Experienced in database management, security, and performance optimization",
                "Skilled in testing, quality assurance, and problem-solving"
            ]
        },
        {
            "company": "VERIFONE",
            "role": "Solutions Architect",
            "roleDescription": "Verifone: American multinational corporation that provides technology for electronic payment transactions and value-added services at the point of sale.",
            "place": "Montevideo",
            "start": "Jan 2022",
            "end": "Feb 2023",
            "responsabilities": [
                "Developed detailed plans with objectives, deadlines, and necessary resources for successful project execution",
                "Designed and implemented IT solutions architecture, aligning with company's business strategy and requirements",
                "Provided consulting support to ensure applications within projects adhered to company's architecture standards",
                "Documented solution architecture analysis and design work, ensuring secure key exchange and encryption of confidential information"
            ]
        },
        {
            "company": "VERIFONE",
            "role": "Senior Software Engineer",
            "roleDescription": "",
            "place": "Montevideo",
            "start": "May 2019",
            "end": "Jan 2022",
            "responsabilities": [
                "Development of detailed plans with project objectives, deadlines, and necessary resources",
                "Migration of applications between development and production environments",
                "Definition and implementation of tasks and components for the SDLC",
                "Analysis, design, and implementation of new requirements",
                "Full-stack developer",
                "Support level 3"
            ]
        },
        {
            "company": "EICMA",
            "role": "Project Manager",
            "roleDescription": "EICMA: Information Technology and Communications Company of the Ministry of Agriculture of Cuba.",
            "place": "Havana",
            "start": "Jan 2018",
            "end": "Jan 2019",
            "responsabilities": [
                "Developed detailed plans with project objectives, deadlines, resources, and tasks",
                "Managed commercial contracts",
                "Sales-oriented IT and Communications Company",
                "Results-oriented development of plans and contracts"
            ]
        },
        {
            "company": "XETID",
            "role": "Senior Sohware Engineer / Team Leader / Project Manager",
            "roleDescription": "XETID: Company dedicated to the software, automation, and communications sector in Cuba.",
            "place": "Havana",
            "start": "Jan 2008",
            "end": "Jan 2017",
            "responsabilities": [
                "Developed detailed plans with objectives, deadlines, and necessary resources for software projects",
                "Collected, analyzed, and recorded business, functional, and non-functional requirements",
                "Identified software solutions that enhanced end-user experience",
                "Managed software development projects, providing support and ensuring code quality",
                "Fostered talent and established a culture of continuous improvement within the software team",
                "Review and verification of the project code and correction of errors",
                "Full-stack developer"
            ]
        }
    ],
    "projects": [
        {
            "mame": "",
            "description": "",
            "technologie": []
        }
    ]
}